Revit 2027 API
DirectContext3DHandleSettings.SetTransparency Method
 Sets the transparency value of the handle and the associated DirectContext3D graphics.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTransparency(
	int transparency
)
Public Sub SetTransparency (
	transparency As Integer
)
public:
void SetTransparency(
	int transparency
)
member SetTransparency :
        transparency : int -> unit
Parameters
transparency Int32
 The transparency value to apply (in percentage)
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is invalid. The valid range is 0 through 100
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace